; domain
(define (domain minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :conditional-effects :existential-preconditions :constraints :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem minigrid-problem)
 (:domain minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   red_door_1 red_door_2 yellow_door_1 green_door_1 - door
   yellow_ball_1 purple_ball_1 grey_ball_1 green_ball_1 - ball
   purple_box_1 purple_box_2 purple_box_3 green_box_1 - box
 )
 (:init (agentinroom room_1) (objectinroom purple_ball_1 room_1) (objectinroom purple_box_1 room_1) (objectinroom yellow_ball_1 room_2) (objectinroom green_ball_1 room_2) (objectinroom purple_box_2 room_3) (objectinroom green_box_1 room_3) (objectinroom grey_ball_1 room_3) (objectinroom purple_box_3 room_3) (objectcolor purple_ball_1 purpletype) (objectcolor purple_box_1 purpletype) (objectcolor yellow_ball_1 yellowtype) (objectcolor green_ball_1 greentype) (objectcolor purple_box_2 purpletype) (objectcolor green_box_1 greentype) (objectcolor grey_ball_1 greytype) (objectcolor purple_box_3 purpletype) (objectcolor red_door_1 redtype) (objectcolor red_door_2 redtype) (objectcolor yellow_door_1 yellowtype) (objectcolor green_door_1 greentype) (emptyhands) (locked red_door_1) (locked red_door_2) (locked yellow_door_1) (locked green_door_1) (adjacentrooms room_2 room_1 red_door_1) (adjacentrooms room_1 room_2 red_door_1) (adjacentrooms room_3 room_1 red_door_2) (adjacentrooms room_1 room_3 red_door_2) (adjacentrooms room_4 room_2 yellow_door_1) (adjacentrooms room_2 room_4 yellow_door_1) (adjacentrooms room_4 room_3 green_door_1) (adjacentrooms room_3 room_4 green_door_1) (visited room_1) (= (total-cost) 0))
 (:goal (and (exists (?d - door)
 (and (objectcolor ?d redtype) (adjacentrooms room_2 room_1 ?d) (at_ ?d) (not (locked ?d))))))
 (:constraints (sometime (carrying purple_ball_1)) (sometime (not (locked red_door_1))) (sometime-before (not (locked red_door_1)) (or (not (emptyhands)) (at_ red_door_2))) (sometime (at_ green_door_1)))
 (:metric minimize (total-cost))
)

; plan
1. (gotoobject purple_ball_1 room_1)
   added: (at_ purple_ball_1)
   goals met: 0 of 1
2. (pick purple_ball_1 room_1)
   deleted: (at_ purple_ball_1) (emptyhands) (objectinroom purple_ball_1 room_1)
   added: (carrying purple_ball_1)
   goals met: 0 of 1
3. (gotodoor red_door_2 room_1 room_3)
   added: (at_ red_door_2)
   goals met: 0 of 1
4. (toggle red_door_2)
   deleted: (locked red_door_2)
   goals met: 0 of 1
5. (gotoroom room_1 room_3 red_door_2)
   deleted: (agentinroom room_1) (at_ red_door_2)
   added: (agentinroom room_3) (visited room_3)
   goals met: 0 of 1
6. (gotodoor green_door_1 room_3 room_4)
   added: (at_ green_door_1)
   goals met: 0 of 1
7. (gotoroom room_3 room_1 red_door_2)
   deleted: (agentinroom room_3) (at_ green_door_1)
   added: (agentinroom room_1)
   goals met: 0 of 1
8. (gotodoor red_door_1 room_1 room_2)
   added: (at_ red_door_1)
   goals met: 0 of 1
9. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 1 of 1
